---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.FilterElementIdRule
source: html/5f01dec2-7ff9-5f26-f062-c52662e493fb.htm
---
# FilterElementIdRule Members

Constructs an instance of FilterElementIdRule.